<a href="https://colab.research.google.com/github/koseogluonur/-Python-for-DataScience-and-Machine-Learning-/blob/main/Data_Manipulation_with_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**PANDAS**

In [ ]:
#Pandas Serileri
import pandas as pd

In [ ]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
p_seri=pd.Series([20,36,41,39,68])
p_seri
type(p_seri)

pandas.core.series.Series

In [ ]:
p_seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [ ]:
p_seri.dtype

dtype('int64')

In [ ]:
p_seri.size

5

In [ ]:
p_seri.ndim

1

In [ ]:
p_seri.values

array([20, 36, 41, 39, 68])

In [ ]:
p_seri.head(3)

0    20
1    36
2    41
dtype: int64

In [ ]:
p_seri.tail(2)

3    39
4    68
dtype: int64

In [ ]:
#Index isimlendirmesi
pd.Series([5,10,15,20,25],index=[1,3,5,7,9])

1     5
3    10
5    15
7    20
9    25
dtype: int64

In [ ]:
pd.Series([5,10,15,20,25],index=["x1","x2","x3","x4","x5"])

x1     5
x2    10
x3    15
x4    20
x5    25
dtype: int64

In [ ]:
seri=pd.Series([5,10,15,20,25],index=["x1","x2","x3","x4","x5"])
seri["x1"]

5

In [ ]:
seri["x2":"x4"]

x2    10
x3    15
x4    20
dtype: int64

In [ ]:
#sozluk uzerinden liste oluşturmak
sozluk=pd.Series({"reg":5,"log":6,"sin":8}) 
sozluk

reg    5
log    6
sin    8
dtype: int64

In [ ]:
sozluk={"reg":5,"log":6,"sin":8}
pd.Series(sozluk)

reg    5
log    6
sin    8
dtype: int64

In [ ]:
#İki seriyi birleştirerek oluşturma
pd.concat([p_seri,seri])

0     20
1     36
2     41
3     39
4     68
x1     5
x2    10
x3    15
x4    20
x5    25
dtype: int64

In [ ]:
#Serilerde eleman işlemleri
import numpy as np
a=np.array([14,26,38,42,65])
b=pd.Series(a)
b

0    14
1    26
2    38
3    42
4    65
dtype: int64

In [ ]:
b[0]

14

In [ ]:
b[2:5]

2    38
3    42
4    65
dtype: int64

In [ ]:
x=pd.Series([2,4,6,8,10,12,14,16,18],
               index=["x1","x2","x3","x4","x5","x6","x7","x8","x9"])
x

x1     2
x2     4
x3     6
x4     8
x5    10
x6    12
x7    14
x8    16
x9    18
dtype: int64

In [ ]:
x.index

Index(['x1', 'x2', 'x3', 'x4', 'x5', 'x6', 'x7', 'x8', 'x9'], dtype='object')

In [ ]:
x.keys

<bound method Series.keys of x1     2
x2     4
x3     6
x4     8
x5    10
x6    12
x7    14
x8    16
x9    18
dtype: int64>

In [ ]:
list(x.items())

[('x1', 2),
 ('x2', 4),
 ('x3', 6),
 ('x4', 8),
 ('x5', 10),
 ('x6', 12),
 ('x7', 14),
 ('x8', 16),
 ('x9', 18)]

In [ ]:
"x2" in x

True

In [ ]:
"x12" in x

False

In [ ]:
#Fancy Eleman
x[["x1","x2"]]

x1    2
x2    4
dtype: int64

In [ ]:
x["x2"]=5
x

x1     2
x2     5
x3     6
x4     8
x5    10
x6    12
x7    14
x8    16
x9    18
dtype: int64

**Pandas DataFrame**

In [ ]:
import pandas as pd 
l=[5,10,15,20,25]

pd.DataFrame(l,columns=["değişken_ismi"])

   değişken_ismi
0              5
1             10
2             15
3             20
4             25

In [ ]:
import numpy as np
x=np.arange(1,10).reshape(3,3)
x

pd.DataFrame(x,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [ ]:
#df isimlendirme
df=pd.DataFrame(x,columns=["var1","var2","var3"])
df.head(2)

   var1  var2  var3
0     1     2     3
1     4     5     6

In [ ]:
df.tail(1)

   var1  var2  var3
2     7     8     9

In [ ]:
df.columns=(["deg1","deg2","deg3"])
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [ ]:
df.shape

(3, 3)

In [ ]:
df.ndim

2

In [ ]:
df.size

9

In [ ]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [ ]:
#PandasDataFrame Elemean İşlemleri
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

In [ ]:
sozluk={"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([1, 4, 9, 3, 6]),
 'var2': array([9, 1, 4, 8, 6]),
 'var3': array([5, 3, 1, 0, 8])}

In [ ]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     1     9     5
1     4     1     3
2     9     4     1
3     3     8     0
4     6     6     8

In [ ]:
df[0:1]

   var1  var2  var3
0     1     9     5

In [ ]:
df.index
df.index=["a","b","c","d","e"]
df

   var1  var2  var3
a     1     9     5
b     4     1     3
c     9     4     1
d     3     8     0
e     6     6     8

In [ ]:
df["c":"e"]

   var1  var2  var3
c     9     4     1
d     3     8     0
e     6     6     8

In [ ]:
#Silme
df.drop("a",axis=0)

   var1  var2  var3
b     4     1     3
c     9     4     1
d     3     8     0
e     6     6     8

In [ ]:
df

   var1  var2  var3
a     1     9     5
b     4     1     3
c     9     4     1
d     3     8     0
e     6     6     8

In [ ]:
#Kalıcı olarak silme
df.drop("a",axis=0,inplace=True)
df

   var1  var2  var3
b     4     1     3
c     9     4     1
d     3     8     0
e     6     6     8

In [ ]:
#Fancy(b ve c için bir isme atayıp onu da yazabilirsin.)
df.drop(["b","c"],axis=0,inplace=True)
df

   var1  var2  var3
d     3     8     0
e     6     6     8

In [ ]:
#Değişkenlerle işlemler
"var1" in df

True

In [ ]:
a=["var1","var3","var4"]

for i in a:
   print(i in df)

True
True
False

In [ ]:
df["var1"]

d    3
e    6
Name: var1, dtype: int64

In [ ]:
df["var4"]=df["var1"]+df["var2"]-df["var3"]
df

   var1  var2  var3  var4
d     3     8     0    11
e     6     6     8     4

In [ ]:
#Değişken silme
df.drop("var3",axis=1)

   var1  var2  var4
d     3     8    11
e     6     6     4

In [ ]:
df

   var1  var2  var3  var4
d     3     8     0    11
e     6     6     8     4

In [ ]:
#Orjinal halinden de silmek için 
df.drop("var3",axis=1,inplace=True)
df

   var1  var2  var4
d     3     8    11
e     6     6     4

In [ ]:
#Fancy ile silme
l=["var1","var2"]
df.drop(l,axis=1)

   var4
d    11
e     4

In [ ]:
#Gözlem ve Değişken Seçimi Loc&İloc
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    19     4    21
1    22     5    16
2    10    22    18
3    12    11    23
4    26     1     6
5    29    21    15
6     7    18     2
7    27     3     8
8    20    21    13
9     7     9     1

In [ ]:
#loc:Tanımlandığı şekliyle seçim yapmak için kullanılır.
df.loc[0:3]

   var1  var2  var3
0    19     4    21
1    22     5    16
2    10    22    18
3    12    11    23

In [ ]:
#iloc:Alışık olduğumuz indexleme mantığıyla seçim yapar.
df.iloc[0:3]

   var1  var2  var3
0    19     4    21
1    22     5    16
2    10    22    18

In [ ]:
df.iloc[0,0]

19

In [ ]:
df.iloc[:3,:2]

   var1  var2
0    19     4
1    22     5
2    10    22

In [ ]:
df.loc[0:3,"var2"]

0     4
1     5
2    22
3    11
Name: var2, dtype: int64

In [ ]:
df.iloc[0:3]["var2"]

0     4
1     5
2    22
Name: var2, dtype: int64

In [ ]:
#Koşullu eleman işlemleri
#Index veya satur getirtme
df[0:1]

   var1  var2  var3
0    19     4    21

In [ ]:
#Değişken veya sütun getirtme
df["var2"]

0     4
1     5
2    22
3    11
4     1
5    21
6    18
7     3
8    21
9     9
Name: var2, dtype: int64

In [ ]:
df[0:2][["var1","var2"]]

   var1  var2
0    19     4
1    22     5

In [ ]:
df[df.var1>15]

   var1  var2  var3
0    19     4    21
1    22     5    16
4    26     1     6
5    29    21    15
7    27     3     8
8    20    21    13

In [ ]:
df[df.var1>15]["var1"]

0    19
1    22
4    26
5    29
7    27
8    20
Name: var1, dtype: int64

In [ ]:
df[(df.var1>15)&(df.var3<8)]

   var1  var2  var3
4    26     1     6

In [ ]:
df.loc[(df.var1>15),["var1","var2"]]

   var1  var2
0    19     4
1    22     5
4    26     1
5    29    21
7    27     3
8    20    21

In [ ]:
df[(df.var1>15)][["var1","var2"]]

   var1  var2
0    19     4
1    22     5
4    26     1
5    29    21
7    27     3
8    20    21

In [ ]:
#Join(Birleştirme İşlemleri)
#Concat birleştirme

In [ ]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(5,3))
df1=pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    17    26    13
1    24    20    27
2    21    28    10
3    19    26    18
4    12    27    21

In [ ]:
df2=df1+50
df2

   var1  var2  var3
0    67    76    63
1    74    70    77
2    71    78    60
3    69    76    68
4    62    77    71

In [ ]:
pd.concat([df1,df2])

   var1  var2  var3
0    17    26    13
1    24    20    27
2    21    28    10
3    19    26    18
4    12    27    21
0    67    76    63
1    74    70    77
2    71    78    60
3    69    76    68
4    62    77    71

In [ ]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0    17    26    13
1    24    20    27
2    21    28    10
3    19    26    18
4    12    27    21
5    67    76    63
6    74    70    77
7    71    78    60
8    69    76    68
9    62    77    71

In [ ]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [ ]:
df2.columns=["var1","var2","deg3"]
df2

   var1  var2  deg3
0    67    76    63
1    74    70    77
2    71    78    60
3    69    76    68
4    62    77    71

In [ ]:
pd.concat([df1,df2],ignore_index=True)
#deg değişkeni tanımlı olmadığı için böyle çıkarır.

   var1  var2  var3  deg3
0    17    26  13.0   NaN
1    24    20  27.0   NaN
2    21    28  10.0   NaN
3    19    26  18.0   NaN
4    12    27  21.0   NaN
5    67    76   NaN  63.0
6    74    70   NaN  77.0
7    71    78   NaN  60.0
8    69    76   NaN  68.0
9    62    77   NaN  71.0

In [ ]:
pd.concat([df1,df2],join="inner",ignore_index=True)
#Inner yapısı kesişimlerini getirir.

   var1  var2
0    17    26
1    24    20
2    21    28
3    19    26
4    12    27
5    67    76
6    74    70
7    71    78
8    69    76
9    62    77

In [ ]:
#One to One Join(Merge)

df1=pd.DataFrame({"calısanlar":["Ali","Veli","Selin","Merve"],"Departman":["IT","DATA","HR","DATA"]})
df1

  calısanlar Departman
0        Ali        IT
1       Veli      DATA
2      Selin        HR
3      Merve      DATA

In [ ]:
df2=pd.DataFrame({"calısanlar":["Ali","Veli","Selin","Merve"],"Hire_Date_Year":[2012,2007,2009,2004]})
df2

  calısanlar  Hire_Date_Year
0        Ali            2012
1       Veli            2007
2      Selin            2009
3      Merve            2004

In [ ]:
pd.merge(df1,df2)

  calısanlar Departman  Hire_Date_Year
0        Ali        IT            2012
1       Veli      DATA            2007
2      Selin        HR            2009
3      Merve      DATA            2004

In [ ]:
pd.merge(df1,df2,on ="calısanlar") #default olarak ortak tarafı ekler on kısmı isteğe bağlıdır.

  calısanlar Departman  Hire_Date_Year
0        Ali        IT            2012
1       Veli      DATA            2007
2      Selin        HR            2009
3      Merve      DATA            2004

In [ ]:
#Many to One Join

In [ ]:
df3=pd.merge(df1,df2)
df3

  calısanlar Departman  Hire_Date_Year
0        Ali        IT            2012
1       Veli      DATA            2007
2      Selin        HR            2009
3      Merve      DATA            2004

In [ ]:
df4=pd.DataFrame({"Departman":["IT","DATA","HR"],"Mudur":["Selim","Cihat","Nazlı"]})
df4

  Departman  Mudur
0        IT  Selim
1      DATA  Cihat
2        HR  Nazlı

In [ ]:
pd.merge(df3,df4)

  calısanlar Departman  Hire_Date_Year  Mudur
0        Ali        IT            2012  Selim
1       Veli      DATA            2007  Cihat
2      Merve      DATA            2004  Cihat
3      Selin        HR            2009  Nazlı

In [ ]:
#Many to Many
df5=pd.DataFrame({"Departman":["IT","IT","IT","DATA","DATA","DATA","HR","HR","HR"],
                  "Yetenekler":["C++","JavaScript","SQL","R","Python","SQL","Excel","Outlook","SQL"]})
df5

  Departman  Yetenekler
0        IT         C++
1        IT  JavaScript
2        IT         SQL
3      DATA           R
4      DATA      Python
5      DATA         SQL
6        HR       Excel
7        HR     Outlook
8        HR         SQL

In [ ]:
pd.merge(df1,df5)

   calısanlar Departman  Yetenekler
0         Ali        IT         C++
1         Ali        IT  JavaScript
2         Ali        IT         SQL
3        Veli      DATA           R
4        Veli      DATA      Python
5        Veli      DATA         SQL
6       Merve      DATA           R
7       Merve      DATA      Python
8       Merve      DATA         SQL
9       Selin        HR       Excel
10      Selin        HR     Outlook
11      Selin        HR         SQL

**Aggregation&Grouping**

In [ ]:
#Kullanılıcak basit toplulaştırma(aggregation) fonksiyonları
count()
first()
last()
mean()
median()
min()
max()
std()
var()
sum()

In [ ]:
#Veriseti yüklemek için seaborn kütüphanesinden faydalanıcaz.
import seaborn as sns

df=sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [ ]:
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [ ]:
df.shape

(1035, 6)

In [ ]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [ ]:
df["mass"].mean()

2.6381605847953233

In [ ]:
df["mass"].count()

513

In [ ]:
df["mass"].min()

0.0036

In [ ]:
df["mass"].max()

25.0

In [ ]:
df["mass"].sum()

1353.37638

In [ ]:
df["mass"].std()

3.8186166509616046

In [ ]:
#Böyle teker teker seçmek yerine bütün değişkenler için topluca görürüz.
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [ ]:
#Rahat okumak için transpose al
df.describe().T

                 count         mean  ...       75%       max
number          1035.0     1.785507  ...     2.000       7.0
orbital_period   992.0  2002.917596  ...   526.005  730000.0
mass             513.0     2.638161  ...     3.040      25.0
distance         808.0   264.069282  ...   178.500    8500.0
year            1035.0  2009.070531  ...  2012.000    2014.0

[5 rows x 8 columns]

In [ ]:
#İçindeki eksik gözlemleri göz ardı ederek bakmak istiyorsak
df.dropna().describe().T

                count         mean          std  ...       50%        75%      max
number          498.0     1.734940     1.175720  ...     1.000     2.0000      6.0
orbital_period  498.0   835.778671  1469.128259  ...   357.000   999.6000  17337.5
mass            498.0     2.509320     3.636274  ...     1.245     2.8675     25.0
distance        498.0    52.068213    46.596041  ...    39.940    59.3325    354.0
year            498.0  2007.377510     4.167284  ...  2009.000  2011.0000   2014.0

[5 rows x 8 columns]

In [ ]:
#Grouping
import pandas as pd
df=pd.DataFrame({"Gruplar":["A","B","C","A","B","C"],"Veri":[10,11,52,23,43,55]},
                columns=["Gruplar","Veri"])
df

  Gruplar  Veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [ ]:
df.groupby("Gruplar")

In [ ]:
df.groupby("Gruplar").mean()

         Veri
Gruplar
A        16.5
B        27.0
C        53.5

In [ ]:
df.groupby("Gruplar").sum()

         Veri
Gruplar
A          33
B          54
C         107

In [ ]:
#Dataset üzerinden işlemler yapmaya devam edelim.
import seaborn as sns

df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [ ]:
df.groupby("method")

In [ ]:
df.groupby("method")["orbital_period"]

In [ ]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [ ]:
df.groupby("method")["distance"].mean()

method
Astrometry                         17.875000
Eclipse Timing Variations         315.360000
Imaging                            67.715937
Microlensing                     4144.000000
Orbital Brightness Modulation    1180.000000
Pulsar Timing                    1200.000000
Pulsation Timing Variations              NaN
Radial Velocity                    51.600208
Transit                           599.298080
Transit Timing Variations        1104.333333
Name: distance, dtype: float64

In [ ]:
#Grup üzerinde yine tüm istatiksel işlemleri görmek için
df.groupby("method")["orbital_period"].mean().describe()

count        10.000000
mean      13622.210413
std       36841.667788
min           0.709307
25%         217.632625
50%         996.677340
75%        4352.126190
max      118247.737500
Name: orbital_period, dtype: float64

In [ ]:
#İleri seviye toplulaştırma(Aggregate,Filter,Transform,Apply)
import pandas as pd
import numpy as np
df=pd.DataFrame({"Gruplar":["A","B","C","A","B","C"],
                 "Degisken1":[10,23,33,22,11,19],
                 "Degisken2":[100,253,333,262,111,969]},
                columns=["Gruplar","Degisken1","Degisken2"])
df

  Gruplar  Degisken1  Degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         19        969

In [ ]:
#Aggregate(Kendi istediğin istatiksel toollara erişmek için kullanırsın)
df.groupby("Gruplar").mean()

         Degisken1  Degisken2
Gruplar
A               16        181
B               17        182
C               26        651

In [ ]:
df.groupby("Gruplar").describe()

        Degisken1                        ... Degisken2
            count  mean       std   min  ...       25%    50%    75%    max
Gruplar                                  ...
A             2.0  16.0  8.485281  10.0  ...     140.5  181.0  221.5  262.0
B             2.0  17.0  8.485281  11.0  ...     146.5  182.0  217.5  253.0
C             2.0  26.0  9.899495  19.0  ...     492.0  651.0  810.0  969.0

[3 rows x 16 columns]

In [ ]:
df.groupby("Gruplar").aggregate([min,np.median,max])

        Degisken1            Degisken2
              min median max       min median  max
Gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              19     26  33       333    651  969

In [ ]:
df.groupby("Gruplar").aggregate({"Degisken1": "min","Degisken2":"max"})

         Degisken1  Degisken2
Gruplar
A               10        262
B               11        253
C               19        969

In [ ]:
df.groupby("Gruplar").aggregate({"Degisken1":["min","max"],"Degisken2":["std",np.median]})

        Degisken1       Degisken2
              min max         std median
Gruplar
A              10  22  114.551299    181
B              11  23  100.409163    182
C              19  33  449.719913    651

In [ ]:
#Filter
df
def filter_func(x):
    return x["Degisken1"].std() > 9

In [ ]:
df.groupby("Gruplar").std()

         Degisken1   Degisken2
Gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C         9.899495  449.719913

In [ ]:
df.groupby("Gruplar").filter(filter_func)

  Gruplar  Degisken1  Degisken2
2       C         33        333
5       C         19        969

In [ ]:
#Transform
import pandas as pd
import numpy as np
df=pd.DataFrame({"Gruplar":["A","B","C","A","B","C"],
                 "Degisken1":[10,23,33,22,11,19],
                 "Degisken2":[100,253,333,262,111,969]},
                columns=["Gruplar","Degisken1","Degisken2"])
df

  Gruplar  Degisken1  Degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         19        969

In [ ]:
df["Degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    171
Name: Degisken1, dtype: int64

In [ ]:
df.transform(lambda x: x-x.mean())
#Gruplar kategorik bir olduğu için hata verir.
#Bu yüzden grupları baz almadan verisetini kullanmak gerekir

In [ ]:
new_df=df.iloc[:,1:3]
new_df

   Degisken1  Degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         19        969

In [ ]:
new_df.transform(lambda x: x-x.mean())

   Degisken1  Degisken2
0  -9.666667     -238.0
1   3.333333      -85.0
2  13.333333       -5.0
3   2.333333      -76.0
4  -8.666667     -227.0
5  -0.666667      631.0

In [ ]:
new_df.transform(lambda x: (x-x.mean()) / x.std())

   Degisken1  Degisken2
0  -1.133990  -0.738461
1   0.391031  -0.263736
2   1.564124  -0.015514
3   0.273722  -0.235811
4  -1.016680  -0.704331
5  -0.078206   1.957853

In [ ]:
#Apply
import pandas as pd
import numpy as np
df=pd.DataFrame({
                 "Degisken1":[10,23,33,22,11,19],
                 "Degisken2":[100,253,333,262,111,969]},
                columns=["Gruplar","Degisken1","Degisken2"])
df

  Gruplar  Degisken1  Degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         19        969

In [ ]:
df.apply(np.sum)

Gruplar      ABCABC
Degisken1       118
Degisken2      2028
dtype: object

In [ ]:
df.groupby("Gruplar").apply(np.mean)

         Degisken1  Degisken2
Gruplar
A             16.0      181.0
B             17.0      182.0
C             26.0      651.0

In [ ]:
#Pivot Tables
import pandas as pd
import seaborn as sns
titanic=sns.load_dataset("titanic")
titanic

In [ ]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
titanic.groupby("sex")["age"].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [ ]:
titanic.groupby("sex")[["age"]].mean()
#iKİ Kapalı parantezle table şekline soktuk

              age
sex
female  27.915709
male    30.726645

In [ ]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [ ]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()
#Unstack sadece görünüm yapısını değiştir.

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
#Pivot ile table
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [ ]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
age=pd.cut(titanic["age"],[0,18,65])
age.head(10)

0    (18.0, 65.0]
1    (18.0, 65.0]
2    (18.0, 65.0]
3    (18.0, 65.0]
4    (18.0, 65.0]
5             NaN
6    (18.0, 65.0]
7     (0.0, 18.0]
8    (18.0, 65.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 65]]

In [ ]:
titanic.pivot_table("survived",index=["sex",age],columns="class")
#Birden fazla grup yaparken index içine ekleme yaparız.
#Dışarıdan oluşturğumuz yapıyı tırnak içinde kullanmayız.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 65]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 65]  0.380435  0.073171  0.135000

In [ ]:
titanic.pivot_table("survived",index=["sex",age],columns="class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 65]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 65]  0.380435  0.073171  0.135000

In [ ]:
titanic.pivot_table("survived",index="alive",columns=["sex","class",age])

sex    female                            ...    male
class   First           Second           ...  Second            Third
age   (0, 18] (18, 65] (0, 18] (18, 65]  ... (0, 18] (18, 65] (0, 18] (18, 65]
alive                                    ...
no        0.0      0.0     NaN      0.0  ...     0.0      0.0     0.0      0.0
yes       1.0      1.0     1.0      1.0  ...     1.0      1.0     1.0      1.0

[2 rows x 12 columns]